var warnDZMarkersData = [
		{
         id: '1',
         name: '地灾点1',
         x: '39.906363',
         y: '116.391456',
         le:'red',
         msg: '警告信息1'
    },
		{
         id: '2',
         name: '地灾点2',
         x: '38.906363',
         y: '116.391456',
         le:'orange',
         msg: '警告信息2'
    },
		{
         id: '3',
         name: '地灾点3',
         x: '38.996363',
         y: '116.391456',
         le:'yellow',
         msg: '警告信息3'
    },
		{
         id: '4',
         name: '地灾点4',
         x: '39.996363',
         y: '116.391456',
         le:'blue',
         msg: '警告信息4'
    },
	{
         id: '5',
         name: '地灾点5',
         x: '38.906363',
         y: '116.591456',
         le:'normal',
         msg: '警告信息5'
    },
	{
         id: '6',
         name: '地灾点6',
         x: '38.906363',
         y: '116.991456',
         le:'normal',
         msg: '警告信息6'
    }
]

var dzMarkersData = [
		{
         id: '1',
         name: '地灾点1',
         x: '39.906363',
         y: '117.391456',
         le:'',
         msg: '全部信息1'
    },
		{
         id: '2',
         name: '地灾点2',
         x: '39.906363',
         y: '116.391456',
         le:'',
         msg: '全部信息2'
    },
		{
         id: '3',
         name: '地灾点3',
         x: '38.996363',
         y: '116.391456',
         le:'',
         msg: '全部信息3'
    },
		{
         id: '4',
         name: '地灾点4',
         x: '38.996363',
         y: '117.391456',
         le:'',
         msg: '全部信息4'
    },
	{
         id: '5',
         name: '地灾点5',
         x: '38.996363',
         y: '118.691456',
         le:'',
         msg: '全部信息5'
    },
	{
         id: '6',
         name: '地灾点6',
         x: '39.906363',
         y: '116.191456',
         le:'',
         msg: '全部信息6'
    }
]
   
var warnjcMarkersData = [
		{
         id: '1',
         name: '监测设备1',
         x: '39.936363',
         y: '116.391456',
         le:'red',
         msg: '警告信息1'
    },
		{
         id: '2',
         name: '监测设备2',
         x: '39.966363',
         y: '116.391456',
         le:'orange',
         msg: '警告信息2'
    },
		{
         id: '3',
         name: '监测设备3',
          x: '39.936363',
         y: '116.591456',
         le:'yellow',
         msg: '警告信息3'
    },
		{
         id: '4',
         name: '监测设备4',
          x: '39.956363',
         y: '116.591456',
         le:'blue',
         msg: '警告信息4'
    },
	{
         id: '5',
         name: '监测设备5',
         x: '39.906363',
         y: '116.391456',
         le:'normal',
         msg: '警告信息5'
    },
	{
         id: '6',
         name: '监测设备6',
         x: '39.906363',
         y: '116.091456',
         le:'normal',
         msg: '警告信息6'
    }
]
   