var warnMarkersDataLevel1 = [
		{
         id: '1',
         name: '警告1',
         x: '39.906363',
         y: '116.391456',
         le:'red',
         msg: '警告信息1'
    },
		{
         id: '2',
         name: '警告2',
         x: '38.906363',
         y: '116.391456',
         le:'orange',
         msg: '警告信息2'
    },
		{
         id: '3',
         name: '警告3',
         x: '38.996363',
         y: '116.391456',
         le:'yellow',
         msg: '警告信息3'
    },
		{
         id: '4',
         name: '警告4',
         x: '39.996363',
         y: '116.391456',
         le:'blue',
         msg: '警告信息4'
    },
	{
         id: '5',
         name: '警告5',
         x: '38.906363',
         y: '116.591456',
         le:'normal',
         msg: '警告信息5'
    },
	{
         id: '6',
         name: '警告6',
         x: '38.906363',
         y: '116.991456',
         le:'normal',
         msg: '警告信息6'
    }
]

var warnMarkersDataLevel2 = [
		{
         id: '1',
         name: '全部1',
         x: '39.906363',
         y: '117.391456',
         le:'',
         msg: '全部信息1'
    },
		{
         id: '2',
         name: '全部2',
         x: '39.906363',
         y: '116.391456',
         le:'',
         msg: '全部信息2'
    },
		{
         id: '3',
         name: '全部3',
         x: '38.996363',
         y: '116.391456',
         le:'',
         msg: '全部信息3'
    },
		{
         id: '4',
         name: '全部4',
         x: '38.996363',
         y: '117.391456',
         le:'',
         msg: '全部信息4'
    },
	{
         id: '5',
         name: '全部5',
         x: '38.996363',
         y: '118.691456',
         le:'',
         msg: '全部信息5'
    },
	{
         id: '6',
         name: '全部6',
         x: '39.906363',
         y: '116.191456',
         le:'',
         msg: '全部信息6'
    }
]
   
   